doc/C++DDOpt.org
#+TITLE: C++DDOopt : The CODD Solver 
#+SETUPFILE: setup.config
#+PROPERTY: header-args :dir ~/Sync/org/tmp  :results drawer :wrap example :exports both
#+INCLUDE: code.inc

* Introduction
** What is *CODD*?
*CODD* is a system for modeling and solving combinatorial optimization problems using decision diagram technology. Problems are represented as state-based dynamic programming models using the CODD language specification.  The model specification is used to automatically compile relaxed and restricted decision diagrams, as well as to guide the search process. *CODD* introduces abstractions that allow to generically implement the solver components while maintaining overall execution efficiency.  We demonstrate the functionality of *CODD* on a variety of combinatorial optimization problems and compare its performance to other state-based solvers as well as integer programming and constraint programming solvers.

We consider discrete optimization problems of the form

\begin{array}{rl}
P : ~~ \max & f(x)\\
\textrm{s.t.} & C_i(x), i = 1, \dots, m,\\
& x \in D
\end{array}

where $x=(x_1,\ldots,x_n)$ is a tuple of decision variables, $f$ is a real-valued objective function over $x$ and $C_1,\ldots,C_m$ are constraints over $x$ with $D=D_1 \times \ldots \times D_n$ denoting the  cartesian product of the domains of the variables $x_i$ ($1 \leq i \leq n$).

** Dynamic Programming as a Computational Model
Dynamic programming can be understood as a labeled transition system where sequences of decisions $(x_1,\ldots,x_n)$ lead to sequences of states $(s_1,\ldots,s_{n+1})$ with, at each step $i$, a transition $s_i \stackrel{x_i}{\rightarrow} s_{i+1}$ labeled by decision $x_i$. Each such transition induces a cost $c_i$. The DP formulation then boils down to:
- the definition of the state space ${\cal S}$ with $s_i \in {\cal S}$.
- two distinguished states $s_\top$ and $s_\bot$  in ${\cal S}$ encoding, respectively, the start state for an empty sequence of decision and the sink state for the full problem
- the defition of the labels used on transition and drawn from ${\cal L} = \bigcup_{i=1}^n D_i$
- The state transition function $\tau : {\cal S} \times {\cal L} \rightarrow {\cal S}$ modeling the decisions
- The transition cost function $c : {\cal S} \times {\cal L} \rightarrow \mathbb{R}$.
  
Then, the Dynamic Program over the state sequence $(s_1,\ldots,s_{n+1})$ and the decision sequence $(x_1,\ldots,x_{n})$ is

\begin{array}{rll}
\max & \sum_{i=1}^n c(s_i, x_i) \\
\textrm{s.t.} & s_{i+1} = \tau(s_i, x_i) & \textrm{for all } x_i \in D_i, i=1, \dots, n,\\
 & s_i \in \cal{S} & \textrm{for all } i=1, \dots, n+1.
\end{array}
#+begin_important
Observe that the constraints $(C_1,\ldots,C_m)$ are captured by membership in the state space. Indeed, each state $s_i \in {\cal S}$ is expected to satisfy $\bigwedge_{i=1}^m C_i$.
In particular, the requirement is true for the root state $s_0 \in {\cal S}$ and is preserved by the transition function $\tau$ which, when starting from a state in ${\cal S}$, only consider /legal/ labeled transition leading to members of ${\cal S}$.
#+end_important
Clearly $s_1 = s_\top$ and $s_{n+1}$ may be equal to $s_\bot$, a state satisfying all the constraints and corresponding to the full problem (all decisions were made).

The objective function simply accumulates the cost incurred along each transition and modeled by function $c$.

Path whole last state is $s_\top$ are feasible for the full problem $P$ and the cost of the path is exactly the objective function. The path with the globally optimal cost
is the global optimum to the original maximization problem $P$. Naturally, there are potentially exponentially many such path. 

