doc/C++DDOpt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-19 Fri 17:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++DDOopt : The CODD Solver</title>
<meta name="author" content="Laurent Michel" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">C++DDOopt : The CODD Solver</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge29f9fc">1. Introduction</a>
<ul>
<li><a href="#orgde48e42">1.1. What is <b>CODD</b>?</a></li>
<li><a href="#org370862a">1.2. Dynamic Programming as a Computational Model</a>
<ul>
<li><a href="#org0e0fcd1">1.2.1. Exact Decision Diagrams</a></li>
<li><a href="#org1244153">1.2.2. Restricted Decision Diagrams</a></li>
<li><a href="#org0345823">1.2.3. Relaxed Decision Diagrams</a></li>
</ul>
</li>
<li><a href="#org2a6608f">1.3. <b>CODD</b> Modeling</a>
<ul>
<li><a href="#org819f1e4">1.3.1. TSP Example High Level</a></li>
<li><a href="#orga1734d5">1.3.2. TSP Example in <b>CODD</b></a></li>
</ul>
</li>
<li><a href="#orgcb8a253">1.4. <b>CODD</b> Solving</a></li>
</ul>
</li>
<li><a href="#orgcda5799">2. Installing CODD</a>
<ul>
<li><a href="#orgee057a2">2.1. Download</a></li>
<li><a href="#org92d3b10">2.2. Compilation</a>
<ul>
<li><a href="#org03706d2">2.2.1. Dependencies</a></li>
<li><a href="#orgaf5d737">2.2.2. C++ Standard</a></li>
<li><a href="#org22f8ece">2.2.3. Build system</a></li>
<li><a href="#org7bd06f4">2.2.4. Unit tests</a></li>
<li><a href="#org3916edb">2.2.5. Library</a></li>
</ul>
</li>
<li><a href="#orgc1a0f5c">2.3. Examples</a></li>
</ul>
</li>
<li><a href="#org4d67576">3. The Maximum Independent Set Problem (MISP)</a>
<ul>
<li><a href="#org1cf99cf">3.1. Preamble</a></li>
<li><a href="#orgd591626">3.2. Reading the instance</a></li>
<li><a href="#org44d40e5">3.3. State definition</a></li>
<li><a href="#org448ce62">3.4. Main Model</a>
<ul>
<li><a href="#org1794987">3.4.1. Getting started</a></li>
<li><a href="#org402d76c">3.4.2. The Bound Tracker</a></li>
<li><a href="#org02f3e07">3.4.3. Defining neighbors</a></li>
<li><a href="#org4d0bf17">3.4.4. The actual CODD Model</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2f82c0f">4. Papers</a></li>
<li><a href="#orge09ded3">5. Related Systems</a>
<ul>
<li><a href="#org50a87f8">5.1. DDO</a></li>
<li><a href="#orgd456b5c">5.2. Domain Independent DP</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge29f9fc" class="outline-2">
<h2 id="orge29f9fc"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgde48e42" class="outline-3">
<h3 id="orgde48e42"><span class="section-number-3">1.1.</span> What is <b>CODD</b>?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>CODD</b> is a system for modeling and solving combinatorial optimization problems using decision diagram technology. Problems are represented as state-based dynamic programming models using the CODD language specification.  The model specification is used to automatically compile relaxed and restricted decision diagrams, as well as to guide the search process. <b>CODD</b> introduces abstractions that allow to generically implement the solver components while maintaining overall execution efficiency.  We demonstrate the functionality of <b>CODD</b> on a variety of combinatorial optimization problems and compare its performance to other state-based solvers as well as integer programming and constraint programming solvers.
</p>

<p>
We consider discrete optimization problems of the form
</p>

\begin{array}{rl}
P : ~~ \max & f(x)\\
\textrm{s.t.} & C_i(x), i = 1, \dots, m,\\
& x \in D
\end{array}

<p>
where \(x=(x_1,\ldots,x_n)\) is a tuple of decision variables, \(f\) is a real-valued objective function over \(x\) and \(C_1,\ldots,C_m\) are constraints over \(x\) with \(D=D_1 \times \ldots \times D_n\) denoting the  cartesian product of the domains of the variables \(x_i\) (\(1 \leq i \leq n\)).
</p>
</div>
</div>

<div id="outline-container-org370862a" class="outline-3">
<h3 id="org370862a"><span class="section-number-3">1.2.</span> Dynamic Programming as a Computational Model</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Dynamic programming can be understood as a labeled transition system where sequences of decisions \((x_1,\ldots,x_n)\) lead to sequences of states \((s_1,\ldots,s_{n+1})\) with, at each step \(i\), a transition \(s_i \stackrel{x_i}{\rightarrow} s_{i+1}\) labeled by decision \(x_i\). Each such transition induces a cost \(c_i\). The DP formulation then boils down to:
</p>
<ul class="org-ul">
<li>the definition of the state space \({\cal S}\) with \(s_i \in {\cal S}\).</li>
<li>two distinguished states \(s_\top\) and \(s_\bot\)  in \({\cal S}\) encoding, respectively, the start state for an empty sequence of decision and the sink state for the full problem</li>
<li>the defition of the labels used on transition and drawn from \({\cal L} = \bigcup_{i=1}^n D_i\)</li>
<li>The state transition function \(\tau : {\cal S} \times {\cal L} \rightarrow {\cal S}\) modeling the decisions</li>
<li>The transition cost function \(c : {\cal S} \times {\cal L} \rightarrow \mathbb{R}\).</li>
</ul>

<p>
Then, the Dynamic Program over the state sequence \((s_1,\ldots,s_{n+1})\) and the decision sequence \((x_1,\ldots,x_{n})\) is
</p>

\begin{array}{rll}
\max & \sum_{i=1}^n c(s_i, x_i) \\
\textrm{s.t.} & s_{i+1} = \tau(s_i, x_i) & \textrm{for all } x_i \in D_i, i=1, \dots, n,\\
 & s_i \in \cal{S} & \textrm{for all } i=1, \dots, n+1.
\end{array}
<div class="important" id="org3742c28">
<p>
Observe that the constraints \((C_1,\ldots,C_m)\) are captured by membership in the state space. Indeed, each state \(s_i \in {\cal S}\) is expected to satisfy \(\bigwedge_{i=1}^m C_i\).
In particular, the requirement is true for the root state \(s_0 \in {\cal S}\) and is preserved by the transition function \(\tau\) which, when starting from a state in \({\cal S}\), only consider <i>legal</i> labeled transition leading to members of \({\cal S}\).
</p>

</div>
<p>
Clearly \(s_1 = s_\top\) and \(s_{n+1}\) may be equal to \(s_\bot\), a state satisfying all the constraints and corresponding to the full problem (all decisions were made).
</p>

<p>
The objective function simply accumulates the cost incurred along each transition and modeled by function \(c\).
</p>

<p>
Path whole last state is \(s_\top\) are feasible for the full problem \(P\) and the cost of the path is exactly the objective function. The path with the globally optimal cost
is the global optimum to the original maximization problem \(P\). Naturally, there are potentially exponentially many such path. 
</p>
</div>
