doc/C++DDOpt.html

<div id="outline-container-org0e0fcd1" class="outline-4">
<h4 id="org0e0fcd1"><span class="section-number-4">1.2.1.</span> Exact Decision Diagrams</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<b>CODD</b> provides (for generality's sake) an <i>exact</i> decision diagram that builds the state of the LTS just described and can therefore produce a globally optimal solution. While it is relatively direct, it requires the construction of an exponentially size structure and is therefore only useful as a proof of concept. Formally, the solution set of the
exact decision diagram induced by \(DD_{Exact}(P)\) is identical to the solution set of \(P\), namely \({\cal Sol}(DD_{Exact}(P)) = {\cal Sol}(P)\).
</p>
</div>
</div>

<div id="outline-container-org1244153" class="outline-4">
<h4 id="org1244153"><span class="section-number-4">1.2.2.</span> Restricted Decision Diagrams</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<b>CODD</b> provides <i>restricted</i> decision diagrams. Those differ from exact diagram by discarding (during their top-down construction) nodes whose presence would lead to overflowing a maximal imposed <i>width</i>. Since the approach throws away states, and therefore <i>paths</i> it runs the risk of loosing the optimal solution. Yet, if they yield  paths leading to \(s_\bot\), the best of them is a primal bound to the original problem.
Formally, the solution set of the restricted decision diagram is a subset of the solution set of the original problem \(P\). Namely,
\({\cal Sol}(DD_{Restricted}(P)) \subseteq {\cal Sol}(P)\).
</p>
</div>
</div>

<div id="outline-container-org0345823" class="outline-4">
<h4 id="org0345823"><span class="section-number-4">1.2.3.</span> Relaxed Decision Diagrams</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
<b>CODD</b> provides <i>relaxed</i> decision diagrams. Those differ from exact diagram by <i>merging</i> states whose presence would induce a diagram <i>width</i> exceeding a given bound. The state merge operator must be a legit relaxation in the following sense: it yields a state that no longer satisfies all constraints in \((C_1,\ldots,C_m)\). While this measures ensure that the size of the diagram remains under control, it <i>introduces</i> new states that are no longer satisfiable. Path leading to \(s_\bot\) going through at least one such unsatisfiable state are no longer modeling a solution of the original problem. Formally, the solution set of the relaxed diagram is now a super set of the solution set of the original problem \(P\). Namely,
\({\cal Sol}(DD_{Relaxed}(P)) \supseteq {\cal Sol}(P)\).
</p>

<p>
From the above, one get derive primal bounds using the restricted diagrams and dual bounds using the relaxed one.
</p>

<div class="important" id="org060fbea">
<p>
Note how all three diagrams are based on the same LTS abstractions of states, labels, transitions, merge and costs and equality to \(s_\bot\). These abstractions are the core
modeling facilities offered by <b>CODD</b>. 
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-org2a6608f" class="outline-3">
<h3 id="org2a6608f"><span class="section-number-3">1.3.</span> <b>CODD</b> Modeling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Unsurprisingly, the abstractions presented above match exactly with the <b>CODD</b> API that expects:
</p>
<ul class="org-ul">
<li>A structure to define a state</li>
<li>Two distinguished states \(s_\top\) and \(s_\bot\) used to represent a state with no decisions made (\(s_\top\)) and all possible decision made (\(s_\bot\)).</li>
<li>A label generation function which, given a state \(s_i\) produces the set of potentially viable transitions</li>
<li>A state transition function \(\tau\) which, given a state \(s_i\) and a potentially viable label \(\ell\) produces either nothing (\(\bot\)) or a new state \(s_{i+1}\) such that
\(s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1} \in \tau\).</li>
<li>A cost function \(c\) which, given a state \(s_i\) and a viable label \(\ell\) produces the cost of the transition \(s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1}\)</li>
<li>An equality to \(s_\bot\) function that returns true whenever its input state <i>is</i> \(s_\bot\).</li>
</ul>

<div class="note" id="orgeba866a">
<p>
An <i>optional</i> local dual bounding function which, given a state \(s_i\) compute a coarse dual bound for completing \(s_i\). <i>this optional abstraction</i> is helpful to quickly assess whether a state has any hope of leading to an improving \(s_\bot\). If a state does not, it can be discarded from the relaxation.
</p>

</div>
<p>
Thankfully, C++ is a rich language supporting polymorphic types, first order and higher order functions. Those provide the basis to naturally convey the formal abstractions given above. The <i>state</i> become a <i>type</i> in C++ and all the other abstractions becomes first-order functions (lambdas in C++ parlance).
</p>
</div>
