doc/C++DDOpt.tex

\subsubsection{Exact Decision Diagrams}
\label{sec:orgda9b0a0}
\textbf{CODD} provides (for generality's sake) an \emph{exact} decision diagram that builds the state of the LTS just described and can therefore produce a globally optimal solution. While it is relatively direct, it requires the construction of an exponentially size structure and is therefore only useful as a proof of concept. Formally, the solution set of the
exact decision diagram induced by \(DD_{Exact}(P)\) is identical to the solution set of \(P\), namely \({\cal Sol}(DD_{Exact}(P)) = {\cal Sol}(P)\).

\subsubsection{Restricted Decision Diagrams}
\label{sec:org13d2538}
\textbf{CODD} provides \emph{restricted} decision diagrams. Those differ from exact diagram by discarding (during their top-down construction) nodes whose presence would lead to overflowing a maximal imposed \emph{width}. Since the approach throws away states, and therefore \emph{paths} it runs the risk of loosing the optimal solution. Yet, if they yield  paths leading to \(s_\bot\), the best of them is a primal bound to the original problem.
Formally, the solution set of the restricted decision diagram is a subset of the solution set of the original problem \(P\). Namely,
\({\cal Sol}(DD_{Restricted}(P)) \subseteq {\cal Sol}(P)\).

\subsubsection{Relaxed Decision Diagrams}
\label{sec:orgbe0a0f7}
\textbf{CODD} provides \emph{relaxed} decision diagrams. Those differ from exact diagram by \emph{merging} states whose presence would induce a diagram \emph{width} exceeding a given bound. The state merge operator must be a legit relaxation in the following sense: it yields a state that no longer satisfies all constraints in \((C_1,\ldots,C_m)\). While this measures ensure that the size of the diagram remains under control, it \emph{introduces} new states that are no longer satisfiable. Path leading to \(s_\bot\) going through at least one such unsatisfiable state are no longer modeling a solution of the original problem. Formally, the solution set of the relaxed diagram is now a super set of the solution set of the original problem \(P\). Namely,
\({\cal Sol}(DD_{Relaxed}(P)) \supseteq {\cal Sol}(P)\).

From the above, one get derive primal bounds using the restricted diagrams and dual bounds using the relaxed one.

\begin{important}
Note how all three diagrams are based on the same LTS abstractions of states, labels, transitions, merge and costs and equality to \(s_\bot\). These abstractions are the core
modeling facilities offered by \textbf{CODD}. 
\end{important}

\subsection{\textbf{CODD} Modeling}
\label{sec:org0da3f9b}
Unsurprisingly, the abstractions presented above match exactly with the \textbf{CODD} API that expects:
\begin{itemize}
\item A structure to define a state
\item Two distinguished states \(s_\top\) and \(s_\bot\) used to represent a state with no decisions made (\(s_\top\)) and all possible decision made (\(s_\bot\)).
\item A label generation function which, given a state \(s_i\) produces the set of potentially viable transitions
\item A state transition function \(\tau\) which, given a state \(s_i\) and a potentially viable label \(\ell\) produces either nothing (\(\bot\)) or a new state \(s_{i+1}\) such that
\(s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1} \in \tau\).
\item A cost function \(c\) which, given a state \(s_i\) and a viable label \(\ell\) produces the cost of the transition \(s_i \stackrel{x_i=\ell}{\longrightarrow} s_{i+1}\)
\item An equality to \(s_\bot\) function that returns true whenever its input state \emph{is} \(s_\bot\).
\end{itemize}

\begin{note}
An \emph{optional} local dual bounding function which, given a state \(s_i\) compute a coarse dual bound for completing \(s_i\). \emph{this optional abstraction} is helpful to quickly assess whether a state has any hope of leading to an improving \(s_\bot\). If a state does not, it can be discarded from the relaxation.
\end{note}
Thankfully, C++ is a rich language supporting polymorphic types, first order and higher order functions. Those provide the basis to naturally convey the formal abstractions given above. The \emph{state} become a \emph{type} in C++ and all the other abstractions becomes first-order functions (lambdas in C++ parlance).
