doc/C++DDOpt.tex

\subsubsection{TSP Example High Level}
\label{sec:org5f4cc97}
Consider the task of solving instances of the traveling salesman problem. With the abstraction defined above, to express a TSP over a set of cities \(C=\{1..n\}\) we define:

\begin{itemize}
\item Let a state \(s \in {\cal S}\) be a triplet \(\langle V,l,h\rangle\) with \(V \subseteq C\) the set of cities visited thus far, \(l\) the name of the city last visited (or 0 at the start), and \(h\) the number of hops made thus far (or 0 at the start).
\item Let \(s_\top = \langle \emptyset,0,0\rangle\) since no cities have been visited, hence last city is the fake city 0 and the salesman did not do any "hops"
\item Let \(s_\bot = \langle V,1,n\rangle\). Indeed, without loss of generality, we will start from city 1 and thus \emph{return} to city 1 (which will thus be the last visited). The trip will have carried out \(n\) hops and visited all cities in \(V\).
\item The label generator is a function \(L : {\cal S} \rightarrow {\cal L}(\langle V,l,h\rangle) = \{1\} \cup C \setminus V\)
\item The function \(\tau : {\cal S} \times {\cal L} \rightarrow {\cal S}\) is
\end{itemize}
\begin{array}{lcll}
\tau(\langle V,l,h \rangle,\ell) &=& \bot & \Leftrightarrow \ell=1 \wedge h < n-1 \\
&& \bot & \Leftrightarrow \ell\neq 1 \wedge h \geq n-1 \\
&& \langle C , \ell, h+1 \rangle & \Leftrightarrow \ell \notin V \wedge \ell \neq l \wedge \ell=1 \wedge h \geq n-1\\
&& \langle V \cup \{\ell\},\ell,h+1 \rangle & \Leftrightarrow \ell \notin V \wedge \ell \neq l \wedge h < n\\
&& \bot & \Leftrightarrow \mbox{otherwise}
\end{array}
The condition \(\ell=1 \wedge h < n-1\)  identifies an attempt to return to the first city too early.
Likewise, the condition \(\ell\neq 1 \wedge h \geq n-1\) is indicative of an attempt to build extend a tour with more than \(n-1\) hops without returning to the initial city.
The third case is a valid attempt at closing a tour with \(n-1\) hops by returning to the first city.
The fourth case is the vanilla situation of extending a known tour with one more hop. 
