doc/C++DDOpt.org
*** TSP Example in *CODD*
Modeling with *CODD* first requires the addition of a type to represent a state. Since a state is a triplet, the model uses a =C= structure.

#+begin_src c++
struct TSP {
   GNSet  s;
   int last;
   int hops;
   friend std::ostream& operator<<(std::ostream& os,const TSP& m) {
      return os << "<" << m.s << ',' << m.last << ',' << m.hops << ">";
   }
};
#+end_src
Note the additional output operator that is used to inspect state.
In addition to the state, *CODD* expects to provide 2 standard operations on state. Equality testing and hashing. Namely, 
#+begin_src c++
template<> struct std::equal_to<TSP> {
   constexpr bool operator()(const TSP& s1,const TSP& s2) const {
      return s1.last == s2.last && s1.hops==s2.hops && s1.s == s2.s;
   }
};
#+end_src
Is a STL compliant implementation of equality testing for a type =T= which, here, is none other than =TSP=.
Likewise, the STL compliant fragment below
#+begin_src c++
template<> struct std::hash<TSP> {
   std::size_t operator()(const TSP& v) const noexcept {
      return (std::hash<GNSet>{}(v.s) << 24) |
         (std::hash<int>{}(v.last) << 16) |
         std::hash<int>{}(v.hops);
   }
};
#+end_src
defines a =hash= operator for our state type =TSP=.  Both state equality and state hashing are used internally by *CODD*.

It is now possible to define both $s_\top$ and $s_\bot$ with:
#+begin_src c++
  const auto init = []() {   // The root state
     return TSP { GNSet{},1,0 };
  };
  const auto target = [&C,sz]() {    // The sink state
     return TSP { C,1,sz };
  };
#+end_src
Note how the =init= and the =target= closures can be called to manufacture the desired states.

The label generation function is also defined with a simple closure
#+begin_src c++
  const auto lgf = [&C](const TSP& s)  {
     auto r = C;
     r.diffWith(s.s);
     r.insert(1);
     return r;
  };
#+end_src
The body of the closure uses the capture set of cities =C= and removes from it those already visited (and held in =s.s=) but retains the first city (1) to be able to close the tour.

The function $\tau$ is, unsurprisingly, another closure
#+begin_src c++
  const auto stf = [sz](const TSP& s,const int label) -> std::optional<TSP> {
     bool bad = (label == 1 && s.hops < sz-1) || (label != 1 && s.hops >= sz-1);
     if (bad)
        return std::nullopt;
     else {
        bool close = label==1 && s.hops >= sz-1;
        if (close) return TSP { GNSet {},1,sz};
        else if (!s.s.contains(label) && s.last != label) {
           return TSP { s.s | GNSet{label},label,s.hops + 1};
        } else return std::nullopt;
     }      
  };
#+end_src
The case analysis carried out in the code mirrors exactly the formal definition. The =bad= Boolean matches the first two conditions of $\tau$ and the code return =std::nullopt= to report $\bot$. The =else= block cover the two main cases (good closing of a tour, or extension with a city). Note how a C++ expression like =s.s | GNSet{label}=
is the direct encoding of $V \cup \{\ell\}$ as the =|= operator is used for set union.

The cost of a transition is also modeled with a closure that reads:
#+begin_src c++
  const auto scf = [&es](const TSP& s,int label) { // partial cost function 
     return es.at(GE {s.last,label});
  };
#+end_src
It simply looks up in a /map/ =es= the weight associated to the edge originating at vertex =s.last= and ending at vertex =label=.

The state merge capability to support relaxed diagram is simply:
#+begin_src c++
  const auto smf = [](const TSP& s1,const TSP& s2) -> std::optional<TSP> {
     if (s1.last == s2.last && s1.hops == s2.hops) 
        return TSP {s1.s & s2.s , s1.last, s1.hops};
     else return std::nullopt; // return  the empty optional
  };
#+end_src
Observe how this closure takes two states $s_1$ and $s_2$ and considers them
mergeable if they both end in the same city and have the same number of hops. The relaxation stems from the fact that the set /intersection/ between $s_1.s$ and $s_2.s$ will only retain cities that were visited in both.

Finally, the equality to the sink (target) state is another closure:
#+begin_src c++
  const auto eqs = [sz](const TSP& s) -> bool {
     return s.last == 1 && s.hops == sz;
  };  
#+end_src
Which deems state $s$ equal to the sink if the last city is 1 and we have the desired number of hops $sz$. 
 
