doc/C++DDOpt.html

<div id="outline-container-orga1734d5" class="outline-4">
<h4 id="orga1734d5"><span class="section-number-4">1.3.2.</span> TSP Example in <b>CODD</b></h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Modeling with <b>CODD</b> first requires the addition of a type to represent a state. Since a state is a triplet, the model uses a <code>C</code> structure.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">struct</span> <span style="color: #204a87;">TSP</span> {
   <span style="color: #204a87;">GNSet</span>  <span style="color: #b35000;">s</span>;
   <span style="color: #204a87;">int</span> <span style="color: #b35000;">last</span>;
   <span style="color: #204a87;">int</span> <span style="color: #b35000;">hops</span>;
   <span style="color: #346604;">friend</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #346604;">operator</span><span style="color: #a40000;">&lt;&lt;</span>(<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #b35000;">os</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">m</span>) {
      <span style="color: #346604;">return</span> os &lt;&lt; <span style="color: #5c3566;">"&lt;"</span> &lt;&lt; m.s &lt;&lt; <span style="color: #5c3566;">','</span> &lt;&lt; m.last &lt;&lt; <span style="color: #5c3566;">','</span> &lt;&lt; m.hops &lt;&lt; <span style="color: #5c3566;">"&gt;"</span>;
   }
};
</pre>
</div>
<p>
Note the additional output operator that is used to inspect state.
In addition to the state, <b>CODD</b> expects to provide 2 standard operations on state. Equality testing and hashing. Namely, 
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">template</span>&lt;&gt; <span style="color: #346604;">struct</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">equal_to</span>&lt;TSP&gt; {
   <span style="color: #346604;">constexpr</span> <span style="color: #204a87;">bool</span> <span style="color: #346604;">operator</span><span style="color: #a40000;">()</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s1</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s2</span>) <span style="color: #346604;">const</span> {
      <span style="color: #346604;">return</span> s1.last == s2.last &amp;&amp; s1.hops==s2.hops &amp;&amp; s1.s == s2.s;
   }
};
</pre>
</div>
<p>
Is a STL compliant implementation of equality testing for a type <code>T</code> which, here, is none other than <code>TSP</code>.
Likewise, the STL compliant fragment below
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">template</span>&lt;&gt; <span style="color: #346604;">struct</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;TSP&gt; {
   <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">size_t</span> <span style="color: #346604;">operator</span><span style="color: #a40000;">()</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">v</span>) <span style="color: #346604;">const</span> <span style="color: #346604;">noexcept</span> {
      <span style="color: #346604;">return</span> (<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;GNSet&gt;{}(v.s) &lt;&lt; 24) |
         (<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;<span style="color: #204a87;">int</span>&gt;{}(v.last) &lt;&lt; 16) |
         <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;<span style="color: #204a87;">int</span>&gt;{}(v.hops);
   }
};
</pre>
</div>
<p>
defines a <code>hash</code> operator for our state type <code>TSP</code>.  Both state equality and state hashing are used internally by <b>CODD</b>.
</p>

<p>
It is now possible to define both \(s_\top\) and \(s_\bot\) with:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">init</span> = []() {   <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">The root state</span>
   <span style="color: #346604;">return</span> TSP { GNSet{},1,0 };
};
<span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">target</span> = [&amp;<span style="color: #b35000;">C</span>,<span style="color: #204a87; font-weight: bold;">sz</span>]() {    <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">The sink state</span>
   <span style="color: #346604;">return</span> TSP { C,1,sz };
};
</pre>
</div>
<p>
Note how the <code>init</code> and the <code>target</code> closures can be called to manufacture the desired states.
</p>

<p>
The label generation function is also defined with a simple closure
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">lgf</span> = [&amp;<span style="color: #b35000;">C</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s</span>)  {
   <span style="color: #346604;">auto</span> <span style="color: #b35000;">r</span> = C;
   r.diffWith(s.s);
   r.insert(1);
   <span style="color: #346604;">return</span> r;
};
</pre>
</div>
<p>
The body of the closure uses the capture set of cities <code>C</code> and removes from it those already visited (and held in <code>s.s</code>) but retains the first city (1) to be able to close the tour.
</p>

<p>
The function \(\tau\) is, unsurprisingly, another closure (which captures <code>sz</code> and <code>C</code> denoting, respectively, the number of cities and the set of cities.)
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">stf</span> = [<span style="color: #204a87; font-weight: bold;">sz</span>,&amp;<span style="color: #b35000;">C</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">int</span> <span style="color: #b35000;">label</span>) -&gt; <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">optional</span>&lt;<span style="color: #204a87;">TSP</span>&gt; {
   <span style="color: #204a87;">bool</span> bad = (label == 1 &amp;&amp; s.hops &lt; sz-1) || (label != 1 &amp;&amp; s.hops &gt;= sz-1);
   <span style="color: #346604;">if</span> (bad)
      <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::nullopt;
   <span style="color: #346604;">else</span> {
      <span style="color: #204a87;">bool</span> <span style="color: #b35000;">close</span> = label==1 &amp;&amp; s.hops &gt;= sz-1;
      <span style="color: #346604;">if</span> (close) <span style="color: #346604;">return</span> TSP { C,1,sz};
      <span style="color: #346604;">else</span> <span style="color: #346604;">if</span> (!s.s.contains(label) &amp;&amp; s.last != label) {
         <span style="color: #346604;">return</span> TSP { s.s | GNSet{label},label,s.hops + 1};
      } <span style="color: #346604;">else</span> <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::nullopt;
   }      
};
</pre>
</div>
<p>
The case analysis carried out in the code mirrors exactly the formal definition. The <code>bad</code> Boolean matches the first two conditions of \(\tau\) and the code return <code>std::nullopt</code> to report \(\bot\). The <code>else</code> block cover the two main cases (good closing of a tour, or extension with a city). Note how a C++ expression like <code>s.s | GNSet{label}</code>
is the direct encoding of \(V \cup \{\ell\}\) as the <code>|</code> operator is used for set union.
</p>

<p>
The cost of a transition is also modeled with a closure that reads:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">scf</span> = [&amp;<span style="color: #b35000;">es</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s</span>,<span style="color: #204a87;">int</span> <span style="color: #b35000;">label</span>) { <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">partial cost function </span>
   <span style="color: #346604;">return</span> es.at(GE {s.last,label});
};
</pre>
</div>
<p>
It simply looks up in a <i>map</i> <code>es</code> the weight associated to the edge originating at vertex <code>s.last</code> and ending at vertex <code>label</code>.
</p>

<p>
The state merge capability to support relaxed diagram is simply:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">smf</span> = [](<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s1</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s2</span>) -&gt; <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">optional</span>&lt;<span style="color: #204a87;">TSP</span>&gt; {
   <span style="color: #346604;">if</span> (s1.last == s2.last &amp;&amp; s1.hops == s2.hops) 
      <span style="color: #346604;">return</span> TSP {s1.s &amp; s2.s , s1.last, s1.hops};
   <span style="color: #346604;">else</span> <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::nullopt; <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">return  the empty optional</span>
};
</pre>
</div>
<p>
Observe how this closure takes two states \(s_1\) and \(s_2\) and considers them
mergeable if they both end in the same city and have the same number of hops. The relaxation stems from the fact that the set <i>intersection</i> between \(s_1.s\) and \(s_2.s\) will only retain cities that were visited in both.
</p>

<p>
Finally, the equality to the sink (target) state is another closure:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">eqs</span> = [<span style="color: #204a87; font-weight: bold;">sz</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">TSP</span>&amp; <span style="color: #b35000;">s</span>) -&gt; <span style="color: #204a87;">bool</span> {
   <span style="color: #346604;">return</span> s.last == 1 &amp;&amp; s.hops == sz;
};  
</pre>
</div>
<p>
Which deems state \(s\) equal to the sink if the last city is 1 and we have the desired number of hops \(sz\). 
</p>
</div>
</div>
</div>
