doc/C++DDOpt.tex

\subsubsection{TSP Example in \textbf{CODD}}
\label{sec:orgea1e7ef}
Modeling with \textbf{CODD} first requires the addition of a type to represent a state. Since a state is a triplet, the model uses a \texttt{C} structure.

\begin{minted}[]{c++}
struct TSP {
   GNSet  s;
   int last;
   int hops;
   friend std::ostream& operator<<(std::ostream& os,const TSP& m) {
      return os << "<" << m.s << ',' << m.last << ',' << m.hops << ">";
   }
};
\end{minted}
Note the additional output operator that is used to inspect state.
In addition to the state, \textbf{CODD} expects to provide 2 standard operations on state. Equality testing and hashing. Namely, 
\begin{minted}[]{c++}
template<> struct std::equal_to<TSP> {
   constexpr bool operator()(const TSP& s1,const TSP& s2) const {
      return s1.last == s2.last && s1.hops==s2.hops && s1.s == s2.s;
   }
};
\end{minted}
Is a STL compliant implementation of equality testing for a type \texttt{T} which, here, is none other than \texttt{TSP}.
Likewise, the STL compliant fragment below
\begin{minted}[]{c++}
template<> struct std::hash<TSP> {
   std::size_t operator()(const TSP& v) const noexcept {
      return (std::hash<GNSet>{}(v.s) << 24) |
         (std::hash<int>{}(v.last) << 16) |
         std::hash<int>{}(v.hops);
   }
};
\end{minted}
defines a \texttt{hash} operator for our state type \texttt{TSP}.  Both state equality and state hashing are used internally by \textbf{CODD}.

It is now possible to define both \(s_\top\) and \(s_\bot\) with:
\begin{minted}[]{c++}
const auto init = []() {   // The root state
   return TSP { GNSet{},1,0 };
};
const auto target = [&C,sz]() {    // The sink state
   return TSP { C,1,sz };
};
\end{minted}
Note how the \texttt{init} and the \texttt{target} closures can be called to manufacture the desired states.

The label generation function is also defined with a simple closure
\begin{minted}[]{c++}
const auto lgf = [&C](const TSP& s)  {
   auto r = C;
   r.diffWith(s.s);
   r.insert(1);
   return r;
};
\end{minted}
The body of the closure uses the capture set of cities \texttt{C} and removes from it those already visited (and held in \texttt{s.s}) but retains the first city (1) to be able to close the tour.

The function \(\tau\) is, unsurprisingly, another closure (which captures \texttt{sz} and \texttt{C} denoting, respectively, the number of cities and the set of cities.)
\begin{minted}[]{c++}
const auto stf = [sz,&C](const TSP& s,const int label) -> std::optional<TSP> {
   bool bad = (label == 1 && s.hops < sz-1) || (label != 1 && s.hops >= sz-1);
   if (bad)
      return std::nullopt;
   else {
      bool close = label==1 && s.hops >= sz-1;
      if (close) return TSP { C,1,sz};
      else if (!s.s.contains(label) && s.last != label) {
         return TSP { s.s | GNSet{label},label,s.hops + 1};
      } else return std::nullopt;
   }      
};
\end{minted}
The case analysis carried out in the code mirrors exactly the formal definition. The \texttt{bad} Boolean matches the first two conditions of \(\tau\) and the code return \texttt{std::nullopt} to report \(\bot\). The \texttt{else} block cover the two main cases (good closing of a tour, or extension with a city). Note how a C++ expression like \texttt{s.s | GNSet\{label\}}
is the direct encoding of \(V \cup \{\ell\}\) as the \texttt{|} operator is used for set union.

The cost of a transition is also modeled with a closure that captures the edge set \texttt{es} and reads:
\begin{minted}[]{c++}
const auto scf = [&es](const TSP& s,int label) { // partial cost function 
   return es.at(GE {s.last,label});
};
\end{minted}
It simply looks up in the edge \emph{map} \texttt{es} the weight associated to the edge originating at vertex \texttt{s.last} and ending at vertex \texttt{label}.

The state merge capability to support relaxed diagram is simply:
\begin{minted}[]{c++}
const auto smf = [](const TSP& s1,const TSP& s2) -> std::optional<TSP> {
   if (s1.last == s2.last && s1.hops == s2.hops) 
      return TSP {s1.s & s2.s , s1.last, s1.hops};
   else return std::nullopt; // return  the empty optional
};
\end{minted}
Observe how this closure takes two states \(s_1\) and \(s_2\) and considers them
mergeable if they both end in the same city and have the same number of hops. The relaxation stems from the fact that the set \emph{intersection} between \(s_1.s\) and \(s_2.s\) will only retain cities that were visited in both.

Finally, the equality to the sink (target) state is another closure:
\begin{minted}[]{c++}
const auto eqs = [sz](const TSP& s) -> bool {
   return s.last == 1 && s.hops == sz;
};  
\end{minted}
Which deems state \(s\) equal to the sink if the last city is 1 and we have the desired number of hops \(sz\). 
