doc/C++DDOpt.html

<div id="outline-container-orgcb8a253" class="outline-3">
<h3 id="orgcb8a253"><span class="section-number-3">1.4.</span> <b>CODD</b> Solving</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Solving the TSP then reduces to <i>instantiating</i> the generic solver with all the closures defined earlier. Namely:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #204a87;">BAndB</span> <span style="color: #b35000;">engine</span>(<span style="color: #204a87; font-weight: bold;">DD</span>&lt;TSP,<span style="color: #204a87;">Minimize</span>&lt;<span style="color: #204a87;">double</span>&gt;, <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">to minimize</span>
             <span style="color: #346604;">decltype</span>(target),
             <span style="color: #346604;">decltype</span>(lgf),
             <span style="color: #346604;">decltype</span>(stf),
             <span style="color: #346604;">decltype</span>(scf),
             <span style="color: #346604;">decltype</span>(smf),
             <span style="color: #346604;">decltype</span>(eqs)
             &gt;::makeDD(init,target,lgf,stf,scf,smf,eqs,labels),1);
engine.search(bnds);
</pre>
</div>
<p>
Note how the <code>DD</code> template is specialized with the state type <code>TSP</code>, the type
<code>Minimize&lt;double&gt;</code> to convey that this is a minimization, and the types of the various
closures using the C++-23 <code>decltype</code> operator. The solver is invoked with the last line.
</p>
<div class="important" id="org2cedf04">
<p>
Note that <b>CODD</b> users never directly call any of those closures. Calls to the closures are
choreographed by the solver to build the diagrams and reason with them. <b>CODD</b> users are strictly focused on defining the DP LTS in a mathematical sense and then doing the 1-1 translation to C++. 
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-orgcda5799" class="outline-2">
<h2 id="orgcda5799"><span class="section-number-2">2.</span> Installing CODD</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgee057a2" class="outline-3">
<h3 id="orgee057a2"><span class="section-number-3">2.1.</span> Download</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The CODD solver is available on <a href="https://github.com/ldmbouge/CPPddOpt">github</a>. 
</p>
</div>
</div>
<div id="outline-container-org92d3b10" class="outline-3">
<h3 id="org92d3b10"><span class="section-number-3">2.2.</span> Compilation</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The CODD C++ library implements both the modeling and the solving framework. It extensively
relies on functional closures to deliver concise, declarative and elegant models.
It has:
</p>
<ul class="org-ul">
<li>Restricted / exact / relax diagrams</li>
<li>State definition, initial, terminal, tranistion and state merging functions separated</li>
<li>Label generation functions</li>
<li>Equivalence predicate for sink.</li>
</ul>
<p>
It allows to define model to solve problems using a dynamic programming style with the
support of underlying decision diagrams.
</p>
</div>

<div id="outline-container-org03706d2" class="outline-4">
<h4 id="org03706d2"><span class="section-number-4">2.2.1.</span> Dependencies</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
You need <code>graphviz</code> (The <code>dot</code> binary) to create graph images. It happens
automatically when the <code>display</code> method is called. Temporary files are created
in <code>/tmp</code> and the macOS <code>open</code> command is used (via <code>fork/execlp</code>)  to open the generated PDF. The rest of the system is vanilla C++-23 and <code>cmake</code>.
</p>
<div class="hint" id="org0a93e6c">
<p>
Keep in mind that this is optional and only needed if you wish to generate images of
diagrams (typically to debug models).
</p>

</div>
</div>
</div>
<div id="outline-container-orgaf5d737" class="outline-4">
<h4 id="orgaf5d737"><span class="section-number-4">2.2.2.</span> C++ Standard</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
You need a C++-23 capable compiler. gcc and clang should both work. I work on macOS where I use the mainline clang coming with Xcode. The implementation uses templates and concepts to factor the code.
</p>
</div>
</div>
<div id="outline-container-org22f8ece" class="outline-4">
<h4 id="org22f8ece"><span class="section-number-4">2.2.3.</span> Build system</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This is <code>cmake</code>. Simply do the following
</p>
<div class="org-src-container">
<pre class="src src-bash">mkdir build
<span style="color: #75507b;">cd</span> build
cmake ..
make -j4
</pre>
</div>
<p>
And it will compile the whole thing. To compile in optimized mode, simply change
the variable <code>CMAKE_BUILD_TYPE</code> from <code>Debug</code> to <code>Release</code> as shown below:
</p>
<div class="org-src-container">
<pre class="src src-bash">cmake .. -DCMAKE_BUILD_TYPE=Release
</pre>
</div>
</div>
</div>
<div id="outline-container-org7bd06f4" class="outline-4">
<h4 id="org7bd06f4"><span class="section-number-4">2.2.4.</span> Unit tests</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
In the <code>test</code> folder. Mostly for the low-level containers.
</p>
</div>
</div>
<div id="outline-container-org3916edb" class="outline-4">
<h4 id="org3916edb"><span class="section-number-4">2.2.5.</span> Library</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
All of it in the <code>src</code> folder.
</p>
<div class="org-src-container">
<pre class="src src-shell">scc -i cpp,org,h,hpp ..
</pre>
</div>

<pre class="example" id="org001715b">
───────────────────────────────────────────────────────────────────────────────
Language                 Files     Lines   Blanks  Comments     Code Complexity
───────────────────────────────────────────────────────────────────────────────
C++                         28      4286      292       286     3708        643
C++ Header                  15      3096      132       338     2626        431
Org                          3       771       97         0      674        100
───────────────────────────────────────────────────────────────────────────────
Total                       46      8153      521       624     7008       1174
───────────────────────────────────────────────────────────────────────────────
Estimated Cost to Develop (organic) $208,674
Estimated Schedule Effort (organic) 7.58 months
Estimated People Required (organic) 2.44
───────────────────────────────────────────────────────────────────────────────
Processed 268762 bytes, 0.269 megabytes (SI)
───────────────────────────────────────────────────────────────────────────────

</pre>
</div>
</div>
</div>
