doc/C++DDOpt.tex

\subsection{\textbf{CODD} Solving}
\label{sec:org64d2198}
Solving the TSP then reduces to \emph{instantiating} the generic solver with all the closures defined earlier. Namely:
\begin{minted}[]{c++}
BAndB engine(DD<TSP,Minimize<double>, // to minimize
             decltype(target),
             decltype(lgf),
             decltype(stf),
             decltype(scf),
             decltype(smf),
             decltype(eqs)
             >::makeDD(init,target,lgf,stf,scf,smf,eqs,labels),1);
engine.search(bnds);
\end{minted}
Note how the \texttt{DD} template is specialized with the state type \texttt{TSP}, the type
\texttt{Minimize<double>} to convey that this is a minimization, and the types of the various
closures using the C++-23 \texttt{decltype} operator. The solver is invoked with the last line.
\begin{important}
Note that \textbf{CODD} users never directly call any of those closures. Calls to the closures are
choreographed by the solver to build the diagrams and reason with them. \textbf{CODD} users are strictly focused on defining the DP LTS in a mathematical sense and then doing the 1-1 translation to C++. 
\end{important}

\section{Installing CODD}
\label{sec:org9276b22}
\subsection{Download}
\label{sec:org2d6e52d}
The CODD solver is available on \href{https://github.com/ldmbouge/CPPddOpt}{github}. 
\subsection{Compilation}
\label{sec:org1f3f1c6}
The CODD C++ library implements both the modeling and the solving framework. It extensively
relies on functional closures to deliver concise, declarative and elegant models.
It has:
\begin{itemize}
\item Restricted / exact / relax diagrams
\item State definition, initial, terminal, tranistion and state merging functions separated
\item Label generation functions
\item Equivalence predicate for sink.
\end{itemize}
It allows to define model to solve problems using a dynamic programming style with the
support of underlying decision diagrams.

\subsubsection{Dependencies}
\label{sec:org7a80238}
You need \texttt{graphviz} (The \texttt{dot} binary) to create graph images. It happens
automatically when the \texttt{display} method is called. Temporary files are created
in \texttt{/tmp} and the macOS \texttt{open} command is used (via \texttt{fork/execlp})  to open the generated PDF. The rest of the system is vanilla C++-23 and \texttt{cmake}.
\begin{hint}
Keep in mind that this is optional and only needed if you wish to generate images of
diagrams (typically to debug models).
\end{hint}
\subsubsection{C++ Standard}
\label{sec:orgab29937}
You need a C++-23 capable compiler. gcc and clang should both work. I work on macOS where I use the mainline clang coming with Xcode. The implementation uses templates and concepts to factor the code.
\subsubsection{Build system}
\label{sec:orgf07e095}
This is \texttt{cmake}. Simply do the following
\begin{minted}[]{bash}
mkdir build
cd build
cmake ..
make -j4
\end{minted}
And it will compile the whole thing. To compile in optimized mode, simply change
the variable \texttt{CMAKE\_BUILD\_TYPE} from \texttt{Debug} to \texttt{Release} as shown below:
\begin{minted}[]{bash}
cmake .. -DCMAKE_BUILD_TYPE=Release
\end{minted}
\subsubsection{Unit tests}
\label{sec:orgab31dce}
oIn the \texttt{test} folder. Mostly for the low-level containers.
\subsubsection{Library}
\label{sec:orgd901705}
All of it in the \texttt{src} folder.
\begin{minted}[]{shell}
scc  -i cpp,org,h,hpp ..
\end{minted}

\begin{verbatim}
───────────────────────────────────────────────────────────────────────────────
Language                 Files     Lines   Blanks  Comments     Code Complexity
───────────────────────────────────────────────────────────────────────────────
C++                         29      4288      298       274     3716        670
C++ Header                  15      3098      132       338     2628        431
Org                          3       778       99         0      679        100
───────────────────────────────────────────────────────────────────────────────
Total                       47      8164      529       612     7023       1201
───────────────────────────────────────────────────────────────────────────────
Estimated Cost to Develop (organic) $209,143
Estimated Schedule Effort (organic) 7.59 months
Estimated People Required (organic) 2.45
───────────────────────────────────────────────────────────────────────────────
Processed 270533 bytes, 0.271 megabytes (SI)
───────────────────────────────────────────────────────────────────────────────

\end{verbatim}
