doc/C++DDOpt.org
** Examples
To be found in the ~examples~ folder
- ~coloringtoy~ tiny coloring bench (same as in python)
- ~foo~ maximum independent set (toy size)
- ~tstpoy~ tiny TSP instance (same as in python)
- ~gruler~ golomb ruler (usage <size> <ubOnLabels>)
- ~misp~ the maximum independent set problem
* The Maximum Independent Set Problem (MISP)
It is, perhaps, most effective to look at some models
to get a reasonable sense of the effort it takes to model and
solve a problem with *CODD*. 
** Preamble
To start using CODD, it is sufficent to include its main header as follow
#+name: preamble
#+begin_src c++
#include "codd.hpp"
#+end_src

** Reading the instance
#+name: readingInput
#+begin_src c++
struct GE {
   int a,b;
   friend bool operator==(const GE& e1,const GE& e2) {
      return e1.a == e2.a && e1.b == e2.b;
   }
   friend std::ostream& operator<<(std::ostream& os,const GE& e) {
      return os  << e.a << "-->" << e.b;
   }
};

struct Instance {
   int nv;
   int ne;
   std::vector<GE> edges;
   FArray<GNSet> adj;
   Instance() : adj(0) {}
   Instance(Instance&& i) : nv(i.nv),ne(i.ne),edges(std::move(i.edges)) {}
   GNSet vertices() {
      return setFrom(std::views::iota(0,nv));
   }
   auto getEdges() const noexcept { return edges;}
   void convert() {
      adj = FArray<GNSet>(nv+1);
      for(const auto& e : edges) {
         adj[e.a].insert(e.b);
         adj[e.b].insert(e.a);
      }         
   }
};

Instance readFile(const char* fName)
{
   Instance i;
   using namespace std;
   ifstream f(fName);
   while (!f.eof()) {
      char c;
      f >> c;
      if (f.eof()) break;
      switch(c) {
         case 'c': {
            std::string line;
            std::getline(f,line);
         }break;
         case 'p': {
            string w;
            f >> w >> i.nv >> i.ne;
         }break;
         case 'e': {
            GE edge;
            f >> edge.a >> edge.b;
            edge.a--,edge.b--;      // make it zero-based
            assert(edge.a >=0);
            assert(edge.b >=0);
            i.edges.push_back(edge);
         }break;
      }
   }
   f.close();
   i.convert();
   return i;
}  
#+end_src

The C structure =GE= is meant to represent a /graph edge/. It inlines a friend function to print edges and an equality operator.  The C struct =Instance= is used to encapsulate
an instance of the MISP problem read from a text file. It holds the number of vertices =nv=, the number of edges =ne=, the list of =edges= and computes and holds the adjacency list =adj=. The latter is computed by the =convert= method which simply scans the edges
in =edges= and adds the endpoints in the respective sets of the adjacency vector. Note that the vertices are numbered from 0 onward (so the last vertex number is =nv - 1=). 

The =readFile=  function produces an =Instance= from a named file =fName=. Note how it shifts the vertex identifiers of edges down by 1 since the standard instances use a 1-based numbering scheme rather than a 0-based numbering scheme.

