doc/C++DDOpt.html

<div id="outline-container-orgc1a0f5c" class="outline-3">
<h3 id="orgc1a0f5c"><span class="section-number-3">2.3.</span> Examples</h3>
<div class="outline-text-3" id="text-2-3">
<p>
To be found in the <code>examples</code> folder
</p>
<ul class="org-ul">
<li><code>coloringtoy</code> tiny coloring bench (same as in python)</li>
<li><code>foo</code> maximum independent set (toy size)</li>
<li><code>tstpoy</code> tiny TSP instance (same as in python)</li>
<li><code>gruler</code> golomb ruler (usage &lt;size&gt; &lt;ubOnLabels&gt;)</li>
<li><code>misp</code> the maximum independent set problem</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4d67576" class="outline-2">
<h2 id="org4d67576"><span class="section-number-2">3.</span> The Maximum Independent Set Problem (MISP)</h2>
<div class="outline-text-2" id="text-3">
<p>
It is, perhaps, most effective to look at some models
to get a reasonable sense of the effort it takes to model and
solve a problem with <b>CODD</b>. 
</p>
</div>
<div id="outline-container-org1cf99cf" class="outline-3">
<h3 id="org1cf99cf"><span class="section-number-3">3.1.</span> Preamble</h3>
<div class="outline-text-3" id="text-3-1">
<p>
To start using CODD, it is sufficent to include its main header as follow
</p>
<div class="org-src-container">
<pre class="src src-c++" id="orgbf3afc8"><span style="color: #75507b;">#include</span> <span style="color: #5c3566;">"codd.hpp"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd591626" class="outline-3">
<h3 id="orgd591626"><span class="section-number-3">3.2.</span> Reading the instance</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-c++" id="orgf76a8a4"><span style="color: #346604;">struct</span> <span style="color: #204a87;">GE</span> {
   <span style="color: #204a87;">int</span> <span style="color: #b35000;">a</span>,<span style="color: #b35000;">b</span>;
   <span style="color: #346604;">friend</span> <span style="color: #204a87;">bool</span> <span style="color: #346604;">operator</span><span style="color: #a40000;">==</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">GE</span>&amp; <span style="color: #b35000;">e1</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">GE</span>&amp; <span style="color: #b35000;">e2</span>) {
      <span style="color: #346604;">return</span> e1.a == e2.a &amp;&amp; e1.b == e2.b;
   }
   <span style="color: #346604;">friend</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #346604;">operator</span><span style="color: #a40000;">&lt;&lt;</span>(<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #b35000;">os</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">GE</span>&amp; <span style="color: #b35000;">e</span>) {
      <span style="color: #346604;">return</span> os  &lt;&lt; e.a &lt;&lt; <span style="color: #5c3566;">"--&gt;"</span> &lt;&lt; e.b;
   }
};

<span style="color: #346604;">struct</span> <span style="color: #204a87;">Instance</span> {
   <span style="color: #204a87;">int</span> <span style="color: #b35000;">nv</span>;
   <span style="color: #204a87;">int</span> <span style="color: #b35000;">ne</span>;
   <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">vector</span>&lt;<span style="color: #204a87;">GE</span>&gt; <span style="color: #b35000;">edges</span>;
   <span style="color: #204a87;">FArray</span>&lt;GNSet&gt; <span style="color: #b35000;">adj</span>;
   <span style="color: #a40000;">Instance</span>() : adj(0) {}
   <span style="color: #a40000;">Instance</span>(<span style="color: #204a87;">Instance</span>&amp;&amp; <span style="color: #b35000;">i</span>) : nv(i.nv),ne(i.ne),edges(<span style="color: #204a87; font-weight: bold;">std</span>::move(i.edges)) {}
   <span style="color: #204a87;">GNSet</span> <span style="color: #a40000;">vertices</span>() {
      <span style="color: #346604;">return</span> setFrom(<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87; font-weight: bold;">views</span>::iota(0,nv));
   }
   <span style="color: #346604;">auto</span> <span style="color: #a40000;">getEdges</span>() <span style="color: #346604;">const</span> <span style="color: #346604;">noexcept</span> { <span style="color: #346604;">return</span> edges;}
   <span style="color: #204a87;">void</span> <span style="color: #a40000;">convert</span>() {
      adj = FArray&lt;<span style="color: #204a87;">GNSet</span>&gt;(nv+1);
      <span style="color: #346604;">for</span>(<span style="color: #346604;">const</span> <span style="color: #346604;">auto</span>&amp; <span style="color: #b35000;">e</span> : edges) {
         adj[e.a].insert(e.b);
         adj[e.b].insert(e.a);
      }         
   }
};

<span style="color: #204a87;">Instance</span> <span style="color: #a40000;">readFile</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">char</span>* <span style="color: #b35000;">fName</span>)
{
   <span style="color: #204a87;">Instance</span> <span style="color: #b35000;">i</span>;
   <span style="color: #346604;">using</span> <span style="color: #346604;">namespace</span> <span style="color: #204a87; font-weight: bold;">std</span>;
   <span style="color: #204a87;">ifstream</span> <span style="color: #b35000;">f</span>(fName);
   <span style="color: #346604;">while</span> (!f.eof()) {
      <span style="color: #204a87;">char</span> <span style="color: #b35000;">c</span>;
      f &gt;&gt; c;
      <span style="color: #346604;">if</span> (f.eof()) <span style="color: #346604;">break</span>;
      <span style="color: #346604;">switch</span>(c) {
         <span style="color: #346604;">case</span> <span style="color: #5c3566;">'c'</span>: {
            <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">string</span> <span style="color: #b35000;">line</span>;
            <span style="color: #204a87; font-weight: bold;">std</span>::getline(f,line);
         }<span style="color: #346604;">break</span>;
         <span style="color: #346604;">case</span> <span style="color: #5c3566;">'p'</span>: {
            <span style="color: #204a87;">string</span> <span style="color: #b35000;">w</span>;
            f &gt;&gt; w &gt;&gt; i.nv &gt;&gt; i.ne;
         }<span style="color: #346604;">break</span>;
         <span style="color: #346604;">case</span> <span style="color: #5c3566;">'e'</span>: {
            <span style="color: #204a87;">GE</span> <span style="color: #b35000;">edge</span>;
            f &gt;&gt; edge.a &gt;&gt; edge.b;
            edge.a--,edge.b--;      <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">make it zero-based</span>
            assert(edge.a &gt;=0);
            assert(edge.b &gt;=0);
            i.edges.push_back(edge);
         }<span style="color: #346604;">break</span>;
      }
   }
   f.close();
   i.convert();
   <span style="color: #346604;">return</span> i;
}  
</pre>
</div>

<p>
The C structure <code>GE</code> is meant to represent a <i>graph edge</i>. It inlines a friend function to print edges and an equality operator.  The C struct <code>Instance</code> is used to encapsulate
an instance of the MISP problem read from a text file. It holds the number of vertices <code>nv</code>, the number of edges <code>ne</code>, the list of <code>edges</code> and computes and holds the adjacency list <code>adj</code>. The latter is computed by the <code>convert</code> method which simply scans the edges
in <code>edges</code> and adds the endpoints in the respective sets of the adjacency vector. Note that the vertices are numbered from 0 onward (so the last vertex number is <code>nv - 1</code>). 
</p>

<p>
The <code>readFile</code>  function produces an <code>Instance</code> from a named file <code>fName</code>. Note how it shifts the vertex identifiers of edges down by 1 since the standard instances use a 1-based numbering scheme rather than a 0-based numbering scheme.
</p>
</div>
</div>
