doc/C++DDOpt.org
** State definition
#+name: state
#+begin_src c++

struct MISP {
   GNSet sel;
   int   n;
   friend std::ostream& operator<<(std::ostream& os,const MISP& m) {
      return os << "<" << m.sel << ',' << m.n << ',' << ">";
   }
};

template<> struct std::equal_to<MISP> {
   bool operator()(const MISP& s1,const MISP& s2) const {
      return s1.n == s2.n && s1.sel == s2.sel;         
   }
};

template<> struct std::hash<MISP> {
   std::size_t operator()(const MISP& v) const noexcept {
      return std::rotl(std::hash<GNSet>{}(v.sel),32) ^ std::hash<int>{}(v.n);
   }
};
#+end_src
The =MISP= struct defines the state representation for the DP model. For the /maximum independent set problem/ the state is simply a set of integers named =sel= and an
integer =n= representing the index of the next vertex to consider for inclusion (or exclusion) from the independent set. The next two classe are standard C++ and define the following:
- =std::equal_to<MISP>=: this structure conforms to the STL and defines as equality operator over the state =MISP=
- =sth::hash<MISP>=: this structure conforms to the STL and defines a hash function for

    the state =MISP=. Note how it uses the hash functions for the =int= type and the
  =GNSet= types provided by the STL or the ~CODD~ library.

** Main Model

*** Getting started

#+begin_src c++
  int main(int argc,char* argv[])
  {
     // using STL containers for the graph
     if (argc < 2) {
        std::cout << "usage: coloring <fname> <width>\n";
        exit(1);
     }
     const char* fName = argv[1];
     const int w = argc==3 ? atoi(argv[2]) : 64;
     auto instance = readFile(fName);

     const GNSet ns = instance.vertices();
     const int top = ns.size();
     const std::vector<GE> es = instance.getEdges();
     
     const auto labels = ns | GNSet { top };     // using a plain set for the labels
     std::vector<int> weight(ns.size()+1);
     weight[top] = 0;
     for(auto v : ns) weight[v] = 1;
     ...
#+end_src

The =main= program simply gets the filename from the command line and reads the
instance from the file. It then extract in =ns= the set of vertices, in =top= its cardinality and in =es= the list of edges. The last four lines define the =labels= to be used (the identifier of all vertices together with =top= to encode the transition to the final state in  the decision diagram). They also define the weights of the
vertices. Since the instances are cliques (from the DIMACS challenge), the =weight= of every vertex is 1 while the =weight= of =top= is 0.

