doc/C++DDOpt.html

<div id="outline-container-org44d40e5" class="outline-3">
<h3 id="org44d40e5"><span class="section-number-3">3.3.</span> State definition</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-c++" id="org7fa4db4">
<span style="color: #346604;">struct</span> <span style="color: #204a87;">MISP</span> {
   <span style="color: #204a87;">GNSet</span> <span style="color: #b35000;">sel</span>;
   <span style="color: #204a87;">int</span>   <span style="color: #b35000;">n</span>;
   <span style="color: #346604;">friend</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #346604;">operator</span><span style="color: #a40000;">&lt;&lt;</span>(<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">ostream</span>&amp; <span style="color: #b35000;">os</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">m</span>) {
      <span style="color: #346604;">return</span> os &lt;&lt; <span style="color: #5c3566;">"&lt;"</span> &lt;&lt; m.sel &lt;&lt; <span style="color: #5c3566;">','</span> &lt;&lt; m.n &lt;&lt; <span style="color: #5c3566;">','</span> &lt;&lt; <span style="color: #5c3566;">"&gt;"</span>;
   }
};

<span style="color: #346604;">template</span>&lt;&gt; <span style="color: #346604;">struct</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">equal_to</span>&lt;<span style="color: #204a87;">MISP</span>&gt; {
   <span style="color: #204a87;">bool</span> <span style="color: #346604;">operator</span><span style="color: #a40000;">()</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s1</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s2</span>) <span style="color: #346604;">const</span> {
      <span style="color: #346604;">return</span> s1.n == s2.n &amp;&amp; s1.sel == s2.sel;         
   }
};

<span style="color: #346604;">template</span>&lt;&gt; <span style="color: #346604;">struct</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;<span style="color: #204a87;">MISP</span>&gt; {
   <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">size_t</span> <span style="color: #346604;">operator</span><span style="color: #a40000;">()</span>(<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">v</span>) <span style="color: #346604;">const</span> <span style="color: #346604;">noexcept</span> {
      <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::rotl(<span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;<span style="color: #204a87;">GNSet</span>&gt;{}(v.sel),32) ^ <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">hash</span>&lt;<span style="color: #204a87;">int</span>&gt;{}(v.n);
   }
};
</pre>
</div>
<p>
The <code>MISP</code> struct defines the state representation for the DP model. For the <i>maximum independent set problem</i> the state is simply a set of integers named <code>sel</code> and an
integer <code>n</code> representing the index of the next vertex to consider for inclusion (or exclusion) from the independent set. The next two classe are standard C++ and define the following:
</p>
<ul class="org-ul">
<li><code>std::equal_to&lt;MISP&gt;</code>: this structure conforms to the STL and defines as equality operator over the state <code>MISP</code></li>
<li><p>
<code>sth::hash&lt;MISP&gt;</code>: this structure conforms to the STL and defines a hash function for
</p>

<p>
  the state <code>MISP</code>. Note how it uses the hash functions for the <code>int</code> type and the
<code>GNSet</code> types provided by the STL or the <code>CODD</code> library.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org448ce62" class="outline-3">
<h3 id="org448ce62"><span class="section-number-3">3.4.</span> Main Model</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org1794987" class="outline-4">
<h4 id="org1794987"><span class="section-number-4">3.4.1.</span> Getting started</h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #204a87;">int</span> <span style="color: #a40000;">main</span>(<span style="color: #204a87;">int</span> <span style="color: #b35000;">argc</span>,<span style="color: #204a87;">char</span>* <span style="color: #b35000;">argv</span>[])
{
   <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">using STL containers for the graph</span>
   <span style="color: #346604;">if</span> (argc &lt; 2) {
      <span style="color: #204a87; font-weight: bold;">std</span>::cout &lt;&lt; <span style="color: #5c3566;">"usage: coloring &lt;fname&gt; &lt;width&gt;\n"</span>;
      exit(1);
   }
   <span style="color: #346604;">const</span> <span style="color: #204a87;">char</span>* <span style="color: #b35000;">fName</span> = argv[1];
   <span style="color: #346604;">const</span> <span style="color: #204a87;">int</span> <span style="color: #b35000;">w</span> = argc==3 ? atoi(argv[2]) : 64;
   <span style="color: #346604;">auto</span> <span style="color: #b35000;">instance</span> = readFile(fName);

   <span style="color: #346604;">const</span> <span style="color: #204a87;">GNSet</span> <span style="color: #b35000;">ns</span> = instance.vertices();
   <span style="color: #346604;">const</span> <span style="color: #204a87;">int</span> <span style="color: #b35000;">top</span> = ns.size();
   <span style="color: #346604;">const</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">vector</span>&lt;GE&gt; <span style="color: #b35000;">es</span> = instance.getEdges();

   <span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">labels</span> = ns | GNSet { top };     <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">using a plain set for the labels</span>
   <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">vector</span>&lt;<span style="color: #204a87;">int</span>&gt; <span style="color: #b35000;">weight</span>(ns.size()+1);
   weight[top] = 0;
   <span style="color: #346604;">for</span>(<span style="color: #346604;">auto</span> <span style="color: #b35000;">v</span> : ns) weight[v] = 1;
   ...
</pre>
</div>

<p>
The <code>main</code> program simply gets the filename from the command line and reads the
instance from the file. It then extract in <code>ns</code> the set of vertices, in <code>top</code> its cardinality and in <code>es</code> the list of edges. The last four lines define the <code>labels</code> to be used (the identifier of all vertices together with <code>top</code> to encode the transition to the final state in  the decision diagram). They also define the weights of the
vertices. Since the instances are cliques (from the DIMACS challenge), the <code>weight</code> of every vertex is 1 while the <code>weight</code> of <code>top</code> is 0.
</p>
</div>
</div>
