doc/C++DDOpt.tex

\subsection{State definition}
\label{sec:org13f5de6}
\begin{minted}[]{c++}

struct MISP {
   GNSet sel;
   int   n;
   friend std::ostream& operator<<(std::ostream& os,const MISP& m) {
      return os << "<" << m.sel << ',' << m.n << ',' << ">";
   }
};

template<> struct std::equal_to<MISP> {
   bool operator()(const MISP& s1,const MISP& s2) const {
      return s1.n == s2.n && s1.sel == s2.sel;         
   }
};

template<> struct std::hash<MISP> {
   std::size_t operator()(const MISP& v) const noexcept {
      return std::rotl(std::hash<GNSet>{}(v.sel),32) ^ std::hash<int>{}(v.n);
   }
};
\end{minted}
The \texttt{MISP} struct defines the state representation for the DP model. For the \emph{maximum independent set problem} the state is simply a set of integers named \texttt{sel} and an
integer \texttt{n} representing the index of the next vertex to consider for inclusion (or exclusion) from the independent set. The next two classe are standard C++ and define the following:
\begin{itemize}
\item \texttt{std::equal\_to<MISP>}: this structure conforms to the STL and defines as equality operator over the state \texttt{MISP}
\item \texttt{sth::hash<MISP>}: this structure conforms to the STL and defines a hash function for

  the state \texttt{MISP}. Note how it uses the hash functions for the \texttt{int} type and the
\texttt{GNSet} types provided by the STL or the \texttt{CODD} library.
\end{itemize}

\subsection{Main Model}
\label{sec:org04ad812}

\subsubsection{Getting started}
\label{sec:org8d8d964}

\begin{minted}[]{c++}
int main(int argc,char* argv[])
{
   // using STL containers for the graph
   if (argc < 2) {
      std::cout << "usage: coloring <fname> <width>\n";
      exit(1);
   }
   const char* fName = argv[1];
   const int w = argc==3 ? atoi(argv[2]) : 64;
   auto instance = readFile(fName);

   const GNSet ns = instance.vertices();
   const int top = ns.size();
   const std::vector<GE> es = instance.getEdges();

   const auto labels = ns | GNSet { top };     // using a plain set for the labels
   std::vector<int> weight(ns.size()+1);
   weight[top] = 0;
   for(auto v : ns) weight[v] = 1;
   ...
\end{minted}

The \texttt{main} program simply gets the filename from the command line and reads the
instance from the file. It then extract in \texttt{ns} the set of vertices, in \texttt{top} its cardinality and in \texttt{es} the list of edges. The last four lines define the \texttt{labels} to be used (the identifier of all vertices together with \texttt{top} to encode the transition to the final state in  the decision diagram). They also define the weights of the
vertices. Since the instances are cliques (from the DIMACS challenge), the \texttt{weight} of every vertex is 1 while the \texttt{weight} of \texttt{top} is 0.
