doc/C++DDOpt.html

<div id="outline-container-org402d76c" class="outline-4">
<h4 id="org402d76c"><span class="section-number-4">3.4.2.</span> The Bound Tracker</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
The maximum independent set is an optimization (maximization) problem. CODD needs to track solutions as they get produces and offers the opportunity to execute an arbitrary code fragment when a new solution somes forth. This code fragment can be used, for instance, to check the correctness of the solution. 
</p>

<p>
This task is the responsibility of the <code>Bounds</code> object. Minimally, one simply must declare an instance as follows:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #204a87;">Bounds</span> <span style="color: #b35000;">bnds</span>;
</pre>
</div>

<div class="attention" id="org077c7a6">
<p>
In the MISP example, we illustrate how to respond to incoming solutions. In this case the <code>Bounds</code> instance uses a C++ lambda (a closure) that will be fed a solution <code>inc</code>, i.e., a vector of labels.
</p>

</div>

<p>
Consider the example below:
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #204a87;">Bounds</span> <span style="color: #b35000;">bnds</span>([&amp;<span style="color: #b35000;">es</span>](<span style="color: #346604;">const</span> <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">vector</span>&lt;<span style="color: #204a87;">int</span>&gt;&amp; <span style="color: #b35000;">inc</span>)  {
   <span style="color: #204a87;">bool</span> <span style="color: #b35000;">ok</span> = <span style="color: #204a87; font-weight: bold;">true</span>;    
   <span style="color: #346604;">for</span>(<span style="color: #346604;">const</span> <span style="color: #346604;">auto</span>&amp; <span style="color: #b35000;">e</span> : es) {         
      <span style="color: #204a87;">bool</span> <span style="color: #b35000;">v1In</span> = (e.a &lt; (<span style="color: #204a87;">int</span>)inc.size()) ? inc[e.a] : <span style="color: #204a87; font-weight: bold;">false</span>;
      <span style="color: #204a87;">bool</span> <span style="color: #b35000;">v2In</span> = (e.b &lt; (<span style="color: #204a87;">int</span>)inc.size()) ? inc[e.b] : <span style="color: #204a87; font-weight: bold;">false</span>;
      <span style="color: #346604;">if</span> (<span style="color: #204a87;">v1In</span> &amp;&amp; <span style="color: #b35000;">v2In</span>) {
         <span style="color: #204a87; font-weight: bold;">std</span>::cout &lt;&lt; e &lt;&lt; <span style="color: #5c3566;">" BOTH ep in inc: "</span> &lt;&lt; inc &lt;&lt; <span style="color: #5c3566;">"\n"</span>;
         assert(<span style="color: #204a87; font-weight: bold;">false</span>);
      }
      ok &amp;= !(<span style="color: #204a87;">v1In</span> &amp;&amp; <span style="color: #b35000;">v2In</span>);
   }
   <span style="color: #204a87; font-weight: bold;">std</span>::cout &lt;&lt; <span style="color: #5c3566;">"CHECKER is "</span> &lt;&lt; ok &lt;&lt; <span style="color: #5c3566;">"\n"</span>;
});
</pre>
</div>
<p>
The closure first <i>captures</i> the set of edges (by reference) as checking the validity of a solution simply entails looping over all edges and making sure that not both endpoints of an edge are included in the solution. The <code>for</code> loop binds <code>e</code> to an edge and, provided that the endpoints are mentioned in the solution, looks up the Boolean associated to the vertex in the solution. Note how the solution <code>inc</code> can be a prefix of the full vertex list (hence the conditional expression). If both endpoints are mentionned in the solution, the computation is aborted as this would indicate a bug in the model. 
</p>
</div>
</div>

<div id="outline-container-org02f3e07" class="outline-4">
<h4 id="org02f3e07"><span class="section-number-4">3.4.3.</span> Defining neighbors</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
The main model will make use of the adjacency list, so it is advisable to hold into
a variable <code>neighbors</code> the adjacency list for the graph.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">auto</span> <span style="color: #b35000;">neighbors</span> = instance.adj;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d0bf17" class="outline-4">
<h4 id="org4d0bf17"><span class="section-number-4">3.4.4.</span> The actual CODD Model</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
A CODD model capture a label transition system (LTS). This LTS operates on nodes holding states for the problem. In the case of the maximum independent set, the states are <code>MISP</code> instances. The LTS starts from a <i>source</i> node and forms paths that ultimately target a <i>sink</i> state. A path in the LTS moves from state to state by <i>generating labels</i> and  using a <i>transition</i> function. Each such transition can incur a <i>cost</i>.
</p>

<p>
The CODD solver uses a branch &amp; bound strategy with both a primal and a dual bound. Primal bounds are produced as a matter of course each time an incumbent solution is found, but also through  the used of <b>restricted decision diagrams</b>. Likewise, dual bounds are produced by <b>relaxed decision diagrams</b>. Such relaxed diagrams rely on
<i>merge</i>  operations to collapse state.
</p>

<p>
CODD models all the italicized concepts outlined in the prior paragraphs with C++ closures. The remainder of this section presents them, one at a time.
</p>
</div>

<ol class="org-ol">
<li><a id="org5e88326"></a>The Start State Closure<br />
<div class="outline-text-5" id="text-3-4-4-1">
<p>
The root, start or source state in the MISP application simly holds in the <code>sel</code> property of the state the indices of all legal vertices and holds in <code>n</code> the value 0 to report that the next decision is to be about vertex 0.  Note how the code below
uses the STL <code>std::views::iota</code> to loop over the closed range [0,top] and insert each value <code>i</code> in the set <code>U</code>  that is then used to create and return the root state.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">myInit</span> = [<span style="color: #204a87; font-weight: bold;">top</span>]() {   <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">The root state</span>
    <span style="color: #204a87;">GNSet</span> <span style="color: #b35000;">U</span> = {}; 
    <span style="color: #346604;">for</span>(<span style="color: #346604;">auto</span> <span style="color: #b35000;">i</span> : <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87; font-weight: bold;">views</span>::iota(0,top))
       U.insert(i);
    <span style="color: #346604;">return</span> MISP { U , 0};
 };
</pre>
</div>
</div>
</li>
