doc/C++DDOpt.tex

\subsubsection{The Bound Tracker}
\label{sec:org338ae87}
The maximum independent set is an optimization (maximization) problem. CODD needs to track solutions as they get produces and offers the opportunity to execute an arbitrary code fragment when a new solution somes forth. This code fragment can be used, for instance, to check the correctness of the solution. 

This task is the responsibility of the \texttt{Bounds} object. Minimally, one simply must declare an instance as follows:
\begin{minted}[]{c++}
Bounds bnds;
\end{minted}

\begin{attention}
In the MISP example, we illustrate how to respond to incoming solutions. In this case the \texttt{Bounds} instance uses a C++ lambda (a closure) that will be fed a solution \texttt{inc}, i.e., a vector of labels.
\end{attention}

Consider the example below:
\begin{minted}[]{c++}
Bounds bnds([&es](const std::vector<int>& inc)  {
   bool ok = true;    
   for(const auto& e : es) {         
      bool v1In = (e.a < (int)inc.size()) ? inc[e.a] : false;
      bool v2In = (e.b < (int)inc.size()) ? inc[e.b] : false;
      if (v1In && v2In) {
         std::cout << e << " BOTH ep in inc: " << inc << "\n";
         assert(false);
      }
      ok &= !(v1In && v2In);
   }
   std::cout << "CHECKER is " << ok << "\n";
});
\end{minted}
The closure first \emph{captures} the set of edges (by reference) as checking the validity of a solution simply entails looping over all edges and making sure that not both endpoints of an edge are included in the solution. The \texttt{for} loop binds \texttt{e} to an edge and, provided that the endpoints are mentioned in the solution, looks up the Boolean associated to the vertex in the solution. Note how the solution \texttt{inc} can be a prefix of the full vertex list (hence the conditional expression). If both endpoints are mentionned in the solution, the computation is aborted as this would indicate a bug in the model. 

\subsubsection{Defining neighbors}
\label{sec:orgc7c48ad}

The main model will make use of the adjacency list, so it is advisable to hold into
a variable \texttt{neighbors} the adjacency list for the graph.
\begin{minted}[]{c++}
auto neighbors = instance.adj;
\end{minted}

\subsubsection{The actual CODD Model}
\label{sec:org2f3948b}

A CODD model capture a label transition system (LTS). This LTS operates on nodes holding states for the problem. In the case of the maximum independent set, the states are \texttt{MISP} instances. The LTS starts from a \emph{source} node and forms paths that ultimately target a \emph{sink} state. A path in the LTS moves from state to state by \emph{generating labels} and  using a \emph{transition} function. Each such transition can incur a \emph{cost}.

The CODD solver uses a branch \& bound strategy with both a primal and a dual bound. Primal bounds are produced as a matter of course each time an incumbent solution is found, but also through  the used of \textbf{restricted decision diagrams}. Likewise, dual bounds are produced by \textbf{relaxed decision diagrams}. Such relaxed diagrams rely on
\emph{merge}  operations to collapse state.

CODD models all the italicized concepts outlined in the prior paragraphs with C++ closures. The remainder of this section presents them, one at a time.

\begin{enumerate}
\item The Start State Closure
\label{sec:orgd0c7cb6}
The root, start or source state in the MISP application simly holds in the \texttt{sel} property of the state the indices of all legal vertices and holds in \texttt{n} the value 0 to report that the next decision is to be about vertex 0.  Note how the code below
uses the STL \texttt{std::views::iota} to loop over the closed range [0,top] and insert each value \texttt{i} in the set \texttt{U}  that is then used to create and return the root state.

\begin{minted}[]{c++}
const auto myInit = [top]() {   // The root state
    GNSet U = {}; 
    for(auto i : std::views::iota(0,top))
       U.insert(i);
    return MISP { U , 0};
 };
\end{minted}
