doc/C++DDOpt.org
**** The Sink State Closure
The sink state is chosen, by convention, to hold an empty set for the remaining legal vertices (so no more decision beyond this point) and =top= as the next vertex to consider since top is the index of the last vertex plus 1. Note how the closure capture the =top= local variable.
#+begin_src c++
  const auto myTarget = [top]() {    // The sink state
     return MISP { GNSet {},top};
  };
#+end_src

**** The Label Generation Closure
Moving from one state to the next involves making a decision about the next vertex to be consider for inclusion. Observe that the identity of that vertex is held in the =n= property of the state we are departing. The decision, in this case, is a binary choice. Either we include =n= or we do not. So the label generation function
returns the closed range [0,1] as the valid outgoing labels. Note how the closure takes as input the source state =s= (yet, for the MISP model, the source state is not used for any purposes.).
#+begin_src c++
  const auto lgf = [](const MISP& s)  {
     return Range::close(0,1);
  }; 
#+end_src

**** The State transition Closure
the state transition closure is the heart of the model. It specifies what state to go to when leaving =s= through label =label=. Observe that =s= dictates which vertex to consider in =s.n=. Two cases arise:
- $s.n \geq top$ In this situation, we ran out of vertices. If the remaining legal set is empty ($s.sel = \emptyset$) then we ought to transition to the sink as we are closing a viable path. Otherwise, this is a "dead-end" and the code return nothing (=std::nullopt=) as the API uses the C++ optional type to convey the absence of a transition.
- $s.n < top$ In this situation, we can decide to include =s.n= in the MISP provided that it is still legal (i.e., provided that $s.n \in s.sel$).
  The first line of the second case therefore commits to not transitioning whenever
  $s.n \notin s.sel \wedge label=True$ and thus return =std::nullopt=. Otherwise, =s.n= is eligible (because it is either to be excluded, or it is still legal) and the new state is computed. The new state $out = s.sel \setminus N(s.n) \setminus \{s.n\}$ where $N(s.n)$ refers to the neighbors of $s.n$.  The =diffWith= method implements the set difference calculation. Finally, the result state holds =out= and sets the next vertex to consider to be $top$ if $out = \emptyset$ or $s.n + 1$ otherwise.
  
#+begin_src c++  
  auto myStf = [top,&neighbors](const MISP& s,const int label) -> std::optional<MISP> {
      if (s.n >= top) {
         if (s.sel.empty()) 
            return MISP { GNSet {}, top};
         else return std::nullopt;
      } else {
         if (!s.sel.contains(s.n) && label) return std::nullopt; 
         GNSet out = s.sel;
         out.remove(s.n);   // remove n from state
         if (label) out.diffWith(neighbors[s.n]); 
         const bool empty = out.empty();  // find out if we are done!
         return MISP { std::move(out),empty ? top : s.n + 1}; // build state accordingly
      }
   };
#+end_src

**** The transition Cost Closure
Each transition from a state to another incurs a cost based on the source state and the label used to transition out. CODD once again relies on a closure to report this cost. In the code fragment below, note how the closure capture a reference to the =weight= vector and uses the identity of the vertex being labeled =s.n= as well as the =label= itself  (a 0/1 value) to compute and return the actual cost.
#+begin_src c++
  const auto scf = [&weight](const MISP& s,int label) { // cost function 
     return label * weight[s.n];
  };
#+end_src

