doc/C++DDOpt.html

<li><a id="org3f4e47b"></a>The Sink State Closure<br />
<div class="outline-text-5" id="text-3-4-4-2">
<p>
The sink state is chosen, by convention, to hold an empty set for the remaining legal vertices (so no more decision beyond this point) and <code>top</code> as the next vertex to consider since top is the index of the last vertex plus 1. Note how the closure capture the <code>top</code> local variable.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">myTarget</span> = [<span style="color: #204a87; font-weight: bold;">top</span>]() {    <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">The sink state</span>
   <span style="color: #346604;">return</span> MISP { GNSet {},top};
};
</pre>
</div>
</div>
</li>

<li><a id="orgc438390"></a>The Label Generation Closure<br />
<div class="outline-text-5" id="text-3-4-4-3">
<p>
Moving from one state to the next involves making a decision about the next vertex to be consider for inclusion. Observe that the identity of that vertex is held in the <code>n</code> property of the state we are departing. The decision, in this case, is a binary choice. Either we include <code>n</code> or we do not. So the label generation function
returns the closed range [0,1] as the valid outgoing labels. Note how the closure takes as input the source state <code>s</code> (yet, for the MISP model, the source state is not used for any purposes.).
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">lgf</span> = [](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s</span>)  {
   <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">Range</span>::close(0,1);
}; 
</pre>
</div>
</div>
</li>

<li><a id="org72e00bf"></a>The State transition Closure<br />
<div class="outline-text-5" id="text-3-4-4-4">
<p>
the state transition closure is the heart of the model. It specifies what state to go to when leaving <code>s</code> through label <code>label</code>. Observe that <code>s</code> dictates which vertex to consider in <code>s.n</code>. Two cases arise:
</p>
<ul class="org-ul">
<li>\(s.n \geq top\) In this situation, we ran out of vertices. If the remaining legal set is empty (\(s.sel = \emptyset\)) then we ought to transition to the sink as we are closing a viable path. Otherwise, this is a "dead-end" and the code return nothing (<code>std::nullopt</code>) as the API uses the C++ optional type to convey the absence of a transition.</li>
<li>\(s.n < top\) In this situation, we can decide to include <code>s.n</code> in the MISP provided that it is still legal (i.e., provided that \(s.n \in s.sel\)).
The first line of the second case therefore commits to not transitioning whenever
\(s.n \notin s.sel \wedge label=True\) and thus return <code>std::nullopt</code>. Otherwise, <code>s.n</code> is eligible (because it is either to be excluded, or it is still legal) and the new state is computed. The new state \(out = s.sel \setminus N(s.n) \setminus \{s.n\}\) where \(N(s.n)\) refers to the neighbors of \(s.n\).  The <code>diffWith</code> method implements the set difference calculation. Finally, the result state holds <code>out</code> and sets the next vertex to consider to be \(top\) if \(out = \emptyset\) or \(s.n + 1\) otherwise.</li>
</ul>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">auto</span> <span style="color: #b35000;">myStf</span> = [<span style="color: #204a87; font-weight: bold;">top</span>,&amp;<span style="color: #b35000;">neighbors</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">int</span> <span style="color: #b35000;">label</span>) -&gt; <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">optional</span>&lt;<span style="color: #204a87;">MISP</span>&gt; {
    <span style="color: #346604;">if</span> (s.n &gt;= top) {
       <span style="color: #346604;">if</span> (s.sel.empty()) 
          <span style="color: #346604;">return</span> MISP { GNSet {}, top};
       <span style="color: #346604;">else</span> <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::nullopt;
    } <span style="color: #346604;">else</span> {
       <span style="color: #346604;">if</span> (!s.sel.contains(s.n) &amp;&amp; label) <span style="color: #346604;">return</span> <span style="color: #204a87; font-weight: bold;">std</span>::nullopt; 
       <span style="color: #204a87;">GNSet</span> <span style="color: #b35000;">out</span> = s.sel;
       out.remove(s.n);   <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">remove n from state</span>
       <span style="color: #346604;">if</span> (label) out.diffWith(neighbors[s.n]); 
       <span style="color: #346604;">const</span> <span style="color: #204a87;">bool</span> <span style="color: #b35000;">empty</span> = out.empty();  <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">find out if we are done!</span>
       <span style="color: #346604;">return</span> MISP { <span style="color: #204a87; font-weight: bold;">std</span>::move(out),empty ? top : s.n + 1}; <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">build state accordingly</span>
    }
 };
</pre>
</div>
</div>
</li>

<li><a id="orga972b57"></a>The transition Cost Closure<br />
<div class="outline-text-5" id="text-3-4-4-5">
<p>
Each transition from a state to another incurs a cost based on the source state and the label used to transition out. CODD once again relies on a closure to report this cost. In the code fragment below, note how the closure capture a reference to the <code>weight</code> vector and uses the identity of the vertex being labeled <code>s.n</code> as well as the <code>label</code> itself  (a 0/1 value) to compute and return the actual cost.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">scf</span> = [&amp;<span style="color: #b35000;">weight</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s</span>,<span style="color: #204a87;">int</span> <span style="color: #b35000;">label</span>) { <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">cost function </span>
   <span style="color: #346604;">return</span> label * weight[s.n];
};
</pre>
</div>
</div>
</li>
