doc/C++DDOpt.org
**** The State Merge Closure
CODD computes its dual bound with a relaxation that /merges/ state. The implementation uses a closure which, given two states $s_1$ and $s_2$ determines
whether the two states are mergeable and returns a new state if they are, or the
=std::nullopt= optional if they are not.

In the MISP case, states are always mergeable and the merge result is none other
than the union of the two eligible sets of vertices and the minimum identifier for the next vertex. In the code below the C++ operator =|= conveys the union of the
two sets.
#+begin_src c++
  const auto smf = [](const MISP& s1,const MISP& s2) -> std::optional<MISP> {
     return MISP {s1.sel | s2.sel,std::min(s1.n,s2.n)};
  };
#+end_src

**** Local Bound Closure
#+begin_caution
CODD can use an /optional/ closure to quickly compute dual bounds associated to
states of the LTS. The optional =local= closure is therefore typically lightweight.
#+end_caution
In the case of MISP, a simple dual bound consist of summing up the weight of all the vertices that are still eligible. This is clearly an overestimate as some of these vertices will be ruled out. But it's cheap to compute!
#+begin_src c++
  const auto local = [&weight](const MISP& s) -> double {
     return sum(s.sel,[&weight](auto v) { return weight[v];});
  };      
#+end_src

**** Recognizing the Sink
CODD uses one last (mandatory) closure to establish equality to the sink. It does not rely on the equality operator as recognizing the sink may not require to test all its attributes for equality, but only a subset of them.
#+begin_src c++
  const auto eqs = [](const MISP& s) -> bool {
     return s.sel.size() == 0;
  };
#+end_src

**** Wrapping up
Now that all the mandatory (and optional) closures are defined, it only remains to
instantiate the generic solver with the closures given above and invoke it.

#+begin_hint
The type =Maximize<double>= is used to convey that this is a maximization problem
while the nested =double= type is the type used to track the objective function value and is currently always =double=. CODD supports =Minimize<double>= as well.
#+end_hint

#+begin_src c++   
  BAndB engine(DD<MISP,Maximize<double>, // to maximize
               decltype(myTarget), 
               decltype(lgf),
               decltype(myStf),
               decltype(scf),
               decltype(smf),
               decltype(eqs),
               decltype(local)
               >::makeDD(myInit,myTarget,lgf,myStf,scf,smf,eqs,labels,local),w);
  engine.search(bnds);
  return 0;
}
#+end_src


* Papers

* Related Systems
** DDO
[[https://github.com/xgillard/ddo][DDO]] was created by Pierre Schauss and Xavier Gillard.
It is a generic and efficient framework for MDD-based optimization written in Rust.

** Domain Independent DP
[[https://arxiv.org/abs/2401.13883][DIDP]] is the brainchild of Ryo Kuroiwa, J. Christopher Beck. It can be found [[https://didp.ai][here]] and offers
both a modeling and a solving API for dynamic programming. 

