doc/C++DDOpt.html

<li><a id="orgdb1cff6"></a>The State Merge Closure<br />
<div class="outline-text-5" id="text-3-4-4-6">
<p>
CODD computes its dual bound with a relaxation that <i>merges</i> state. The implementation uses a closure which, given two states \(s_1\) and \(s_2\) determines
whether the two states are mergeable and returns a new state if they are, or the
<code>std::nullopt</code> optional if they are not.
</p>

<p>
In the MISP case, states are always mergeable and the merge result is none other
than the union of the two eligible sets of vertices and the minimum identifier for the next vertex. In the code below the C++ operator <code>|</code> conveys the union of the
two sets.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">smf</span> = [](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s1</span>,<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s2</span>) -&gt; <span style="color: #204a87; font-weight: bold;">std</span>::<span style="color: #204a87;">optional</span>&lt;<span style="color: #204a87;">MISP</span>&gt; {
   <span style="color: #346604;">return</span> MISP {s1.sel | s2.sel,<span style="color: #204a87; font-weight: bold;">std</span>::min(s1.n,s2.n)};
};
</pre>
</div>
</div>
</li>

<li><a id="org634abab"></a>Local Bound Closure<br />
<div class="outline-text-5" id="text-3-4-4-7">
<div class="caution" id="org6d4ceae">
<p>
CODD can use an <i>optional</i> closure to quickly compute dual bounds associated to
states of the LTS. The optional <code>local</code> closure is therefore typically lightweight.
</p>

</div>
<p>
In the case of MISP, a simple dual bound consist of summing up the weight of all the vertices that are still eligible. This is clearly an overestimate as some of these vertices will be ruled out. But it's cheap to compute!
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">local</span> = [&amp;<span style="color: #b35000;">weight</span>](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s</span>) -&gt; <span style="color: #204a87;">double</span> {
   <span style="color: #346604;">return</span> sum(s.sel,[&amp;<span style="color: #b35000;">weight</span>](<span style="color: #346604;">auto</span> <span style="color: #b35000;">v</span>) { <span style="color: #346604;">return</span> weight[v];});
};      
</pre>
</div>
</div>
</li>

<li><a id="org321a6fa"></a>Recognizing the Sink<br />
<div class="outline-text-5" id="text-3-4-4-8">
<p>
CODD uses one last (mandatory) closure to establish equality to the sink. It does not rely on the equality operator as recognizing the sink may not require to test all its attributes for equality, but only a subset of them.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #346604;">const</span> <span style="color: #346604;">auto</span> <span style="color: #b35000;">eqs</span> = [](<span style="color: #346604;">const</span> <span style="color: #204a87;">MISP</span>&amp; <span style="color: #b35000;">s</span>) -&gt; <span style="color: #204a87;">bool</span> {
   <span style="color: #346604;">return</span> s.sel.size() == 0;
};
</pre>
</div>
</div>
</li>

<li><a id="org7b96fe3"></a>Wrapping up<br />
<div class="outline-text-5" id="text-3-4-4-9">
<p>
Now that all the mandatory (and optional) closures are defined, it only remains to
instantiate the generic solver with the closures given above and invoke it.
</p>

<div class="hint" id="org84d0fdf">
<p>
The type <code>Maximize&lt;double&gt;</code> is used to convey that this is a maximization problem
while the nested <code>double</code> type is the type used to track the objective function value and is currently always <code>double</code>. CODD supports <code>Minimize&lt;double&gt;</code> as well.
</p>

</div>

<div class="org-src-container">
<pre class="src src-c++">  <span style="color: #204a87;">BAndB</span> <span style="color: #a40000;">engine</span>(<span style="color: #204a87; font-weight: bold;">DD</span>&lt;MISP,<span style="color: #204a87;">Maximize</span>&lt;<span style="color: #204a87;">double</span>&gt;, <span style="color: #5f615c; font-style: italic;">// </span><span style="color: #5f615c; font-style: italic;">to maximize</span>
               <span style="color: #346604;">decltype</span>(myTarget), 
               <span style="color: #346604;">decltype</span>(lgf),
               <span style="color: #346604;">decltype</span>(myStf),
               <span style="color: #346604;">decltype</span>(scf),
               <span style="color: #346604;">decltype</span>(smf),
               <span style="color: #346604;">decltype</span>(eqs),
               <span style="color: #346604;">decltype</span>(local)
               &gt;::makeDD(myInit,myTarget,lgf,myStf,scf,smf,eqs,labels,local),w);
  engine.search(bnds);
  <span style="color: #346604;">return</span> 0;
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org2f82c0f" class="outline-2">
<h2 id="org2f82c0f"><span class="section-number-2">4.</span> Papers</h2>
</div>

<div id="outline-container-orge09ded3" class="outline-2">
<h2 id="orge09ded3"><span class="section-number-2">5.</span> Related Systems</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org50a87f8" class="outline-3">
<h3 id="org50a87f8"><span class="section-number-3">5.1.</span> DDO</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://github.com/xgillard/ddo">DDO</a> was created by Pierre Schauss and Xavier Gillard.
It is a generic and efficient framework for MDD-based optimization written in Rust.
</p>
</div>
</div>

<div id="outline-container-orgd456b5c" class="outline-3">
<h3 id="orgd456b5c"><span class="section-number-3">5.2.</span> Domain Independent DP</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://arxiv.org/abs/2401.13883">DIDP</a> is the brainchild of Ryo Kuroiwa, J. Christopher Beck. It can be found <a href="https://didp.ai">here</a> and offers
both a modeling and a solving API for dynamic programming. 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Laurent Michel</p>
<p class="date">Created: 2024-04-19 Fri 17:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
